In [198]:
import pandas as pd

dataset = pd.read_csv('vgsales.csv')

In [199]:
dataset.head(5)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [200]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [201]:
dataset.isnull().sum()
# 전체 개수 대비 많은 편일까? -> 각 열별 결측치의 비율
print(dataset.isna().sum()/len(dataset))

Rank            0.000000
Name            0.000000
Platform        0.000000
Year            0.016327
Genre           0.000000
Publisher       0.003494
NA_Sales        0.000000
EU_Sales        0.000000
JP_Sales        0.000000
Other_Sales     0.000000
Global_Sales    0.000000
dtype: float64

In [202]:
dataset.iloc[3:5,1:4]

                       Name Platform    Year
3         Wii Sports Resort      Wii  2009.0
4  Pokemon Red/Pokemon Blue       GB  1996.0

In [203]:
dataset['Year'].value_counts(dropna = False)

Year
2009.0    1431
2008.0    1428
2010.0    1259
2007.0    1202
2011.0    1139
2006.0    1008
2005.0     941
2002.0     829
2003.0     775
2004.0     763
2012.0     657
2015.0     614
2014.0     582
2013.0     546
2001.0     482
1998.0     379
2000.0     349
2016.0     344
1999.0     338
1997.0     289
NaN        271
1996.0     263
1995.0     219
1994.0     121
1993.0      60
1981.0      46
1992.0      43
1991.0      41
1982.0      36
1986.0      21
1989.0      17
1983.0      17
1990.0      16
1987.0      16
1988.0      15
1985.0      14
1984.0      14
1980.0       9
2017.0       3
2020.0       1
Name: count, dtype: int64

In [204]:
dataset.iloc[469:471,:]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
469,470,Dragon Ball Z: Budokai Tenkaichi 3,PS2,2007.0,Fighting,Atari,1.15,0.00,0.76,1.09,3.0
470,471,wwe Smackdown vs. Raw 2006,PS2,NaN,Fighting,NaN,1.57,1.02,0.00,0.41,3.0

In [205]:
#전략 1: Name 컬럼의 마지막 4 character 위치에 가끔 숫자가 났다. 그 숫자로 결측치를 채울 수 있다. 최종적으로 272개 (오기 포함)의 결측치 중 15개를 채워넣었다.
#결론: 검색해보니 15개의 예상년도와 실제년도 동일한다.
nan_indices = dataset[dataset['Year'].isna()].index

# Create a new DataFrame with 'Name' and its corresponding last four letters
result_df = pd.DataFrame({
    'Index': nan_indices,
    'Name': dataset.loc[nan_indices, 'Name'],
    'Last Four Letters': dataset.loc[nan_indices, 'Name'].str[-4:]
})

In [206]:
result_df['Type'] = result_df['Last Four Letters'].apply(lambda x: 'Numeric' if x.isdigit() else 'Text')
result_df.to_csv('missing_data.csv', index=False) #확인용

for index in nan_indices:
    if result_df['Type'][index] == 'Numeric':
        dataset.at[index, "Year"] = int(result_df['Last Four Letters'][index])
    else:
        dataset.at[index, "Year"] = 0

In [207]:
dataset.iloc[469:471,:]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
469,470,Dragon Ball Z: Budokai Tenkaichi 3,PS2,2007.0,Fighting,Atari,1.15,0.00,0.76,1.09,3.0
470,471,wwe Smackdown vs. Raw 2006,PS2,2006.0,Fighting,NaN,1.57,1.02,0.00,0.41,3.0

In [208]:
dataset['Year'] = dataset['Year'].astype(int)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16598 non-null  int64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(5), int64(2), object(4)
memory usage: 1.4+ MB

In [209]:
dataset['Platform'].unique()

array(['Wii', 'NES', 'GB', 'DS', 'X360', 'PS3', 'PS2', 'SNES', 'GBA',
       '3DS', 'PS4', 'N64', 'PS', 'XB', 'PC', '2600', 'PSP', 'XOne', 'GC',
       'WiiU', 'GEN', 'DC', 'PSV', 'SAT', 'SCD', 'WS', 'NG', 'TG16',
       '3DO', 'GG', 'PCFX'], dtype=object)

In [210]:
dataset.dropna(how='any')
dataset.iloc[178:182,:]
dataset.shape

(16598, 11)

In [211]:
dataset.isnull().sum()

Rank             0
Name             0
Platform         0
Year             0
Genre            0
Publisher       58
NA_Sales         0
EU_Sales         0
JP_Sales         0
Other_Sales      0
Global_Sales     0
dtype: int64

In [212]:
dataset.isnull().sum()

Rank             0
Name             0
Platform         0
Year             0
Genre            0
Publisher       58
NA_Sales         0
EU_Sales         0
JP_Sales         0
Other_Sales      0
Global_Sales     0
dtype: int64

In [213]:
dataset['Year'].value_counts(dropna = False)

Year
2009    1431
2008    1430
2010    1259
2007    1203
2011    1140
2006    1010
2005     943
2002     830
2003     779
2004     765
2012     657
2015     614
2014     582
2013     546
2001     482
1998     379
2000     349
2016     344
1999     338
1997     289
1996     263
0        256
1995     219
1994     121
1993      60
1981      46
1992      43
1991      41
1982      36
1986      21
1989      17
1983      17
1987      16
1990      16
1988      15
1985      14
1984      14
1980       9
2017       3
2020       1
Name: count, dtype: int64